Repository: NiryoRobotics/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/tcp_server.po
Languages: fr

source: Use Ned's TCP server
fr: Utilisation du serveur TCP Ned

source: Ned is permanently running a TCP Server to acquire requests. This server is built on top of the :doc:`Ned Python ROS Wrapper <ros_wrapper>`.
fr: Ned exécute en permanence un serveur TCP pour acquérir des requêtes. Ce serveur est construit sur le :doc:`Ned Python ROS Wrapper <ros_wrapper>`.

source: It offers a simple way for developers to create programs for robot to control them via remote communication on a computer, on a mobile or any device with network facilities.
fr: Il offre un moyen simple aux développeurs de créer des programmes pour que le robot les contrôle via une communication à distance sur un ordinateur, sur un mobile ou sur tout autre appareil doté d'une installation réseau.

source: Programs can communicate through network TCP with the robots in any language available.
fr: Les programmes peuvent communiquer via le réseau TCP avec les robots dans n'importe quelle langue disponible.

source: Connection
fr: Connexion

source: To access the server, you will have to use to robot's IP adress and communicate via the **port 40001**.
fr: Pour accéder au serveur, il est nécessaire d'utiliser l’adresse IP du robot et communiquer via le **port 40001**.

source: Only one client can communicate with the server (reconnection effective but no multi clients).
fr: Un seul client peut communiquer avec le serveur (reconnexion effective mais pas de multi clients).

source: The server answers only after the command is done, so it can't deal with multiple commands at the same time.
fr: Le serveur ne répond qu'une fois la commande terminée, il ne peut donc pas traiter plusieurs commandes en même temps.

source: Packet convention
fr: Convention de paquet

source: General format
fr: Format général

source: For easier usage and easier debugging, the communication is based on JSON format.
fr: Pour une utilisation et un débogage simplifiés, la communication est basée sur le format JSON.

source: Every package have this following shape: ``<json_packet_size>{<json_content>}<payload>``.
fr: Chaque package a la forme suivante : ``<json_packet_size>{<json_content>}<payload>``.

source: The JSON packet size is an unsigned short coded on 2 bytes.
fr: La taille du paquet JSON est un code court non signé sur 2 octets.

source: The JSON contains command's name & params.
fr: Le JSON contient le nom et les paramètres de la commande.

source: Payload contains *heavy* data like an image.
fr: La charge utile contient des données lourdes telles qu'une image.

source: Request
fr: Requête

source: Format - Request
fr: Format - Requête

source: As no function requests a payload in input, requests have the following.
fr: Comme aucune fonction ne demande une charge utile en entrée (input), les demandes ont les caractéristiques suivantes.

source: Examples - Request
fr: Requête - Exemples

source: Calibrate auto: ``{'param_list': ['AUTO'], 'command': 'CALIBRATE'}``
fr: Calibration automatique : ``{'param_list': ['AUTO'], 'command': 'CALIBRATE'}``

source: Move joints: ``{'param_list': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], 'command': 'MOVE_JOINTS'}``
fr: Déplacer axes : ``{'param_list': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], 'command': 'MOVE_JOINTS'}``

source: Answer
fr: Réponses

source: Format - Answer
fr: Format - Réponse

source: Firstly, answers indicate to the user if its command has been well executed. This is indicated in the JSON by the parameter "status".
fr: Premièrement, les réponses indiquent à l'utilisateur si sa commande a été correctement exécutée. Ceci est indiqué dans le JSON par le paramètre "status".

source: A successful answer will have the format:
fr: Une réponse réussie aura le format :

source: An unsuccessful answer will have the format: ``{'status': 'KO', 'message': <message_str>}``
fr: Une réponse infructueuse aura le format : ``{'status': 'KO', 'message': <message_str>}``

source: Examples - Answer
fr: Exemples - Réponse

source: Calibrate Auto: ``{'status': 'OK', 'list_ret_param': [], 'payload_size': 0, 'command': 'CALIBRATE'}``
fr: Calibration automatique : ``{'status': 'OK', 'list_ret_param': [], 'payload_size': 0, 'command': 'CALIBRATE'}``

source: Get Pose: ``{'status': 'OK', 'list_ret_param': [0.2, 0.15, 0.35, 0.5, -0.6, 0.1], 'payload_size': 0, 'command': 'GET_POSE'}``
fr: Maintenir une pose : ``{'status': 'OK', 'list_ret_param': [0.2, 0.15, 0.35, 0.5, -0.6, 0.1], 'payload_size': 0, 'command': 'GET_POSE'}``

source: Commands enum for TCP server
fr: Commandes enum pour le serveur TCP

source: Enumeration of all commands used
fr: Enumérations de toutes les commandes utilisées
