Repository: NiryoRobotics/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/python_ros_wrapper/examples_tool_action.po
Languages: fr

source: Examples: tool action
fr: Exemples : les actions avec les outils

source: This page shows how to control Ned's tools via the Python ROS Wrapper.
fr: Cette page montre comment contrôler les outils de Ned via le Python ROS Wrapper.

source: If you want see more, you can look at :ref:`API - Tools<source/python_ros_wrapper/ros_wrapper_doc:Tools>`.
fr: Si vous voulez en savoir plus, vous pouvez consulter l':ref:`API - Tools<source/python_ros_wrapper/ros_wrapper_doc:Tools>`.

source: If you are using the real robot, make sure the environment around it is clear.
fr: Si vous utilisez le vrai robot, assurez-vous que l'environnement autour est dégagé.

source: Tool control
fr: Contrôler un outil

source: Equip tool
fr: Équiper un outil

source: In order to use a tool, it should be mechanically plugged to the robot but also connected software wise.
fr: Afin d'utiliser un outil, celui-ci doit être branché mécaniquement sur le robot mais aussi connecté au niveau logiciel.

source: To do that, we should use the function :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.update_tool` which takes no argument. It will scan motor connections and set the new tool!
fr: Pour effectuer cela, utiliser la fonction :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.update_tool` qui ne prend aucun argument. Il analysera les connexions du moteur et définira le nouvel outil !

source: The line to equip a new tool is: ::
fr: La ligne pour équiper un nouvel outil est : ::

source: Grasping
fr: Saisir un objet

source: To grasp with any tool, you can use the function: :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.grasp_with_tool`. This action corresponds to:
fr: Pour saisir ou attraper un objet avec un outil, utiliser la fonction : :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.grasp_with_tool`. Cette action correspond à :

source: Close gripper for Grippers.
fr: Fermer le Gripper

source: Pull Air for Vacuum pump.
fr: Activer la pompe à vide

source: Activate for Electromagnet.
fr: Activer l'Électroaimant

source: The code to grasp is: ::
fr: Le code pour saisir est : ::

source: To grasp by specifying parameters: ::
fr: Saisir en spécifiant des paramètres : ::

source: Releasing
fr: Relâcher

source: To release with any tool, you can use the function: :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.release_with_tool`. This action correspond to:
fr: Pour relâcher un objet avec un outil, utiliser la fonction : :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.release_with_tool`. Cette action correspond à :

source: Open gripper for Grippers.
fr: Ouvrir le Gripper

source: Push Air for Vacuum pump.
fr: Désactiver la Pompe à vide

source: Deactivate for Electromagnet.
fr: Désactiver l'Électroaimant

source: The line to release is: ::
fr: La ligne de code pour relâcher est : ::

source: To release by specifying parameters: ::
fr: Relâcher en spécifiant des paramètres : ::

source: Pick & place with tools
fr: Pick and place avec un outil

source: There are a plenty of ways to realize a pick and place with the ROS Wrapper. Methods will be presented from the lowest to highest level.
fr: Il existe de nombreuses façons de réaliser un pick and place avec le ROS Wrapper. Les méthodes seront présentées du plus bas au plus haut niveau.

source: Code used will be: ::
fr: Le code utilisé sera : ::

source: First solution: the heaviest
fr: Première solution : la plus lourde

source: Everything is done by hand: ::
fr: Tout est fait à la main : ::

source: Second solution: pick from pose & place from pose functions
fr: Deuxième solution : pick from pose & place from pose functions

source: We use predefined functions: ::
fr: Il est nécessaire d'utiliser des fonctions prédéfinies : ::

source: Third solution: all in one
fr: Troisième solution : Le tout en un

source: We use THE predifined function: ::
fr: Nous utilisons LA fonction prédéfinie : ::
