Repository: NiryoRobotics/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/installation/ubuntu_18.po
Languages: fr

source: Ubuntu 18 Installation
fr: Installer sous Ubuntu 18

source: This guide will explain the steps needed to install the Niryo Robot Stack on an Ubuntu 18 OS. You can apply these steps to set up a working simulation environment on any development computer, or to set up a working robot stack on a Raspberry Pi.
fr: Ce guide va dérouler les étapes nécessaires pour installer la stack des robots Niryo sous Ubuntu 18. Vous pouvez appliquer ces étapes pour mettre en place un environnement de simulation sur un ordinateur de développement quelconque, ou bien l'installer sur une Raspberry Pi en vu de l'utiliser sur un robot réel.

source: Installation index:
fr: Sommaire :

source: Prerequisites
fr: Prérequis

source: The Niryo ROS Stack runs on top of ROS Melodic or Kinetic (deprecated). This version of ROS is strongly dependent of Ubuntu 18.04 version, thus, this OS is currently the only official supported OS.
fr: La stack Niryo ROS tourne sur ROS Melodic ou Kinetic (déprécié). Cette version de ROS est fortement dépendante de la version 18.04 de Ubuntu, ainsi cet OS est aujourd'hui le seul système d'exploitation supporté.

source: Be sure to have an up to date system before continuing
fr: Vérifiez que vous avez un système à jour avant de continuer

source: Ubuntu packages
fr: Paquets Ubuntu

source: The Niryo ROS Stack needs the following packages in order to run correctly:
fr: La stack Niryo ROS nécessite les paquets suivants pour fonctionner correctement :

source: These packages are mostly useful on a real robot, but as the code is identical between simulation and real functioning, a lack of these packages on a simulation can lead to unstabilities.
fr: Ces paquets sont principalement utiles sur un robot réel, mais comme le code est identique entre la simulation et le robot physique, un paquet manquant peut amener à des instabilités de la simulation.

source: Python environment
fr: Environnement Python

source: The Python environment is installed using the requirements_ned2.txt file
fr: L'environnement Python est installé avec le fichier requirements_ned2.txt

source: ROS Melodic is still using Python2 internally so are our Python scripts to keep version alignment. You thus need to install the requirements using Python2 pip2 tool
fr: ROS Melodic utilise python 2 en interne. Nous avons donc gardé cette version de python en interne pour être aligné avec. Vous aurez donc besoin d'utiliser pip de python 2 pour installer ces dépendances

source: ROS set up
fr: Mise en place de ROS

source: All terminal command listed are for Ubuntu users.
fr: Toutes les commandes de terminal listées sont pour des utilisateurs Ubuntu.

source: Place yourself in the folder of your choice and create a folder **catkin_ws_niryo_ned** as well as a sub-folder **src**: ::
fr: Positionnez-vous dans un dossier de votre choix et créés un dossier **catkin_ws_niryo_ned** ainsi qu'un sous-dossier **src**: ::

source: Then go to the folder **catkin_ws_niryo_ned** and clone Ned repository in the folder **src**. For the future operations, be sure to stay in the **catkin_ws_niryo_ned** folder: ::
fr: Ensuite aller dans le dossier **catkin_ws_niryo_ned** et cloner le repository Ned dans le dossier **src**. Pour les prochaines commandes, vérifiez que vous êtes bien dans le dossier **catkin_ws_niryo_ned** : ::

source: Install ROS dependencies
fr: Installer les dépendances de ROS

source: Install ROS
fr: Installer ROS

source: You need to install ROS Melodic. To do so, follow the ROS official tutorial `here <http://wiki.ros.org/melodic/Installation/Ubuntu>`_ and chose the **Desktop-Full Install**.
fr: Vous devez tout d'abord installer ROS Melodic. Pour cela, suivez les instructions du tutoriel officiel de ROS `ici <http://wiki.ros.org/melodic/Installation/Ubuntu>`_ et choisissez l'option **Desktop-Full Install**.

source: Install additional packages
fr: Installet les paquets additionnels

source: To ensure the functioning of all Ned's packages, you need to install several more packages:
fr: Pour assurer le fonctionnement de tous les paquets du Ned, vous devez installer quelques paquets supplémentaires :

source: Method 1: Quick installation via ROSDep
fr: Méthode 1 : Installation rapide via ROSDep

source: For each package, we have referenced all the dependencies in their respective *package.xml* file, which allows to install each dependency via *rosdep* command: ::
fr: Pour chaque package, les dépendances requises sont listées dans leur fichier *package.xml* respectifs, ce qui permet l'installation de chacun d'entre eux via la commande *rosdep* : ::

source: Method 2: Full installation
fr: Méthode 2 : Installation Complète

source: ROS packages needed are:
fr: Les packages ROS requis sont :

source: To install a package on Ubuntu: ::
fr: Pour installer un package sur Ubuntu : ::

source: Melodic specific packages needed are:
fr: Les packages melodic spécifiques requis sont :

source: To install a ROS Melodic's package on Ubuntu: ::
fr: Pour installer un package ROS Melodic sur Ubuntu : ::

source: Setup Ned ROS environment
fr: Mise en place de l'environnement ROS

source: Be sure to be still placed in the **catkin_ws_niryo_ned** folder.
fr: Vérifier que vous êtes bien positionnez dans le dossier **catkin_ws_niryo_ned**.

source: Then perform the **make** of Ned's ROS Stack via the command: ::
fr: Lancez ensuite la compilation de la stack ROS Niryo via la commande suivante : ::

source: If no errors occurred during the **make** phase, the setup of your environment is almost complete!
fr: Si aucune erreur ne se produit pendant la phase de compilation, la mise en place de votre environnement est presque complète !

source: It is necessary to source the configuration file to add all Ned packages to ROS environment. To do so, run the command: ::
fr: Il est nécessaire de sourcer le fichier de configuration pour ajouter tous les packages du Ned dans l'environnement ROS. Pour faire cela, lancer la commande : ::

source: It is necessary to run this command each time you launch a new terminal. If you want to make this sourcing appends for all your future terminals, you can add it to your **bashrc** file: ::
fr: Il est nécessaire de lancer cette commande à chaque fois que vous lancez un nouveau terminal. Si vous voulez l'appliquer à chaque ouverture d'un terminal, vous pouvez ajouter cette ligne à votre fichier **.bashrc** : ::

source: Installation is now finished!
fr: L'installation est maintenant terminée !
