Repository: NiryoRobotics/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/installation/wsl.po
Languages: fr

source: Windows Subsystem for Linux installation (experimental)
fr: Installation pour le Sous-système Windows pour Linux (expérimental)

source: Microsoft is developping since 2016 a compatibility layer for running Linux binary executables natively on Windows 10. With the version 2 issued in 2019, this "hidden Linux kernel" is now mature enough to run complex operations like the full ROS stack [2]_.
fr: Microsoft a développé depuis 2016 une couche de compatibilité pour faire tourner les executables Linux nativement sous Windows 10. Avec la version 2 sortie en 2019, ce "coeur Linux caché" est maintenant assez mûr pour faire faire tourner des programmes aussi complexes que la stack ROS complète [2]_.

source: Thus you will be able to run simulations for the Ned, Niryo One or Ned2 robots on a Windows machine.
fr: Ainsi vous pourrez lancer des simulations pour les robots Ned, le Niryo One et Ned 2 sur une machine Windows.

source: You have to be running Windows 10 version 2004 (Build 19041) or higher for WSL2 to work.
fr: Il vous faut à minima Windows 10 version 2004 (Build 19041) ou plus pour faire tourner WSL2.

source: The installation under WSL is not originally supported by Niryo, this guide is provided on an indicative basis only.
fr: L'installation sous WSL n'étant pas officiellement supportée par Niryo, ce guide n'est fourni qu'à titre d'information seulement.

source: The following guide is mainly adapted from this blog post from Jack Kawell, feel free to refer to it for more complete information [1]_
fr: Ce guide est globalement adapté de ce poste de blog écrit par Jack Kawell, soyer libres de vous y réferer pour de plus amples informations [1]_

source: Install WSL2 [3]_
fr: Installer WSL2 [3]_

source: Enable Windows Subsystem for Linux on your machine (in a powershell terminal)
fr: Activer le Sous-système Linux pour Windows (WSL) sur votre machine (dans un terminal powershell)

source: Update WSL to use version 2 (in a powershell terminal)
fr: Mettre la version de WSL par défaut à 2 (dans un terminal powershell)

source: You then need to restart your machine to finish the WSL installation and the upgrade to WSL2.
fr: Vous devez ensuite redémarrer votre ordinateur pour terminer l'installation de WSL et la mise à jour vers WSL2.

source: Set default version of WSL to 2 (in a powershell terminal)
fr: Mettre la version de WSL par défaut à 2 (dans un terminal powershell)

source: Install an Ubuntu 18.04 distribution using the Windows Store
fr: Installer une distribution Ubuntu 18.04 via le Windows Store

source: Ubuntu 18.04 in the Windows Store
fr: Ubuntu 18.04 sur le Windows Store

source: Launch the app. The first time, it asks you to finish the initialization of the OS.
fr: 6. Lancer l'application. La première fois, on vous demandera de finir l'initialisation du Système d'Exploitation Votre Système Ubuntu est maintenant prêt. Vous pouvez continuer à compiler la stack en utilisant le tutoriel.

source: Your Ubuntu OS is now ready. You can continue the build of the stack using the tutorial.
fr: 6. Lancer l'application. La première fois, on vous demandera de finir l'initialisation du Système d'Exploitation Votre Système Ubuntu est maintenant prêt. Vous pouvez continuer à compiler la stack en utilisant le tutoriel.

source: Setting up GUI forwarding
fr: Mise en place de la redirection d'Interface Graphique

source: WSL does not come with an X server. Thus, you will not be able to launch any graphical windows for now. But we can change this by using a Windows X server and forward the GUI to it using GUI forwarding.
fr: WSL n'est pas fourni avec un serveur X. Vous ne pourrez donc pas lancer d'application graphique dans des fenêtres pour le moment. Mais il est possible d'y remédier en utilisant un serveur X dédié pour Windows et d'y rediriger les sorties graphiques via la redirection d'interface graphique (GUI forwarding).

source: Many X servers exist for Windows 10. We tested VcXsrc, and it correctly does the job. https://sourceforge.net/projects/vcxsrv/
fr: Beaucoup de serveurs X existent pour Windows 10. Nous avons testé VcXsrc en interne, et il fait corretement le job. https://sourceforge.net/projects/vcxsrv/

source: 1. Launch VcXsrv. Be sure to have the following options : - Uncheck "Native OpenGL" - Check "Disable access control"
fr: 1. Lancer VcXsrc. Vérifiez que vous avez bien les options suivantes : - Décocher "Native OpenGL" - Cocher "Disable access control"

source: You can directly use this configuration by using this :download:`configuration file <../../resources/installation/wsl_config.xlaunch>`
fr: Vous pouvez directement utiliser cette configuration en utilisant ce :download:`fichier de configuration <../../resources/installation/wsl_config.xlaunch>`

source: You need to export the address of your Xserver in Ubuntu 18 to forward the GUI
fr: Vous avez besoin d'exporter l'adresse de votre serveur X dans Ubuntu 18 pour rediriger l'interface graphique

source: You can add this to your bashrc file.
fr: Vous pouvez ajouter cette ligne à votre fichier bashrc

source: You can check that your forwarding works by using simple X11 apps for example:
fr: Vous pouvez vérifier que la redirection fonctionne en lançant une application X11 simple par exemple :

source: Install ROS Melodic (see instructions here)
fr: Installer ROS melodic (voir les instructions ici)

source: Try launching Rviz
fr: Essayer de lancer rviz

source: You should now be able to launch any simulation of the One, Ned or Ned2 using Rviz or Gazebo
fr: Vous devriez maintenant être capable de lancer n'importe quelle simulation du One, du Ned ou du Ned2 en utilisatn rviz ou gazebo

source: Troubleshooting
fr: Dépannage

source: Try :
fr: Essayer :

source: Check that you correctly launched your XServer with the required options (Disable access control is essential)
fr: Vérifiez que vous avez correctement lancé le serveur X avec les options nécessaires(Désactiver le contrôle d'accès est nécessaire)

source: Check that the IP you gave is correct (you need the address in /etc/resolv.conf to have it work)
fr: Vérifier que l'addresse IP que vous fournissez est correcte (vous avez besoin de l'addresse dans /etc/resolv.conf pour que cela fonctionne)

source: **OpenGL issues** Some people have said that they run into issues with OpenGL applications like Rviz. If you do, try setting the environment variable LIBGL_ALWAYS_INDIRECT=0 in your WSL2 terminal (you can just add export LIBGL_ALWAYS_INDIRECT=0 to the end of your .bashrc file).
fr: **Problème d'OpenGL** Quelques personnes ont indiqué avec eu des souci avec les applications OpenGL comme Rviz. Si c'est le cas pour vous, essayez de définir la variable d'environnement LIBGL_ALWAYS_INDIRECT=0 dans un terminal WSL2 (vous pouvez par exemple ajouter LIBGL_ALWAYS_INDIRECT=0 à la fin de votre fichier .bashrc).
